<a href="https://colab.research.google.com/github/rizwannitk/modeldeploy/blob/main/model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [2]:
dataset = pd.read_csv('/content/hiring.csv')

In [7]:
dataset

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [4]:
dataset['experience'].fillna(0, inplace=True)

In [6]:
dataset['test_score'].fillna(dataset['test_score'].mean(), inplace=True)